package com.studentcenter.weave.domain.enum

enum class Mbti (
    val description: String,
){
    ISTJ("실용적이고 현실적인, 조직적인 계획가"),
    ISFJ("친절하고 책임감 있으며, 세심한 관찰자"),
    INFJ("직관적이고, 영감을 주는, 복잡한 생각을 가진 사람"),
    INTJ("전략적 사고를 가진, 독립적이고 창의적인 계획가"),
    ISTP("융통성 있고, 관찰력이 뛰어난, 실용적인 해결사"),
    ISFP("예술적이고, 호기심이 많으며, 적응력이 좋은 탐험가"),
    INFP("이상주의적이고, 창의적인, 늘 새로운 가능성을 추구하는 사람"),
    INTP("논리적이고, 호기심이 많으며, 지적인 사고를 가진 사람"),
    ESTP("에너지가 넘치고, 실용적이며, 행동을 중시하는 사람"),
    ESFP("사교적이고, 활동적이며, 즐거움을 추구하는 사람"),
    ENFP("열정적이고, 창의적이며, 자유로운 영혼을 가진 사람"),
    ENTP("발명적이고, 호기심이 많으며, 끊임없이 새로운 것을 추구하는 사람"),
    ESTJ("실용적이고, 효율적이며, 체계적인 관리자"),
    ESFJ("협조적이고, 친절하며, 인화를 중요시하는 사람"),
    ENFJ("친절하고, 영감을 주며, 타인을 돕는 리더"),
    ENTJ("대담하고, 자신감 있으며, 비전을 가진 리더"),
}
